Revit 2024 API
ScheduleFieldId.InvalidScheduleFieldId Property
 Get the invalid ScheduleFieldId whose IntegerValue is -1.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ScheduleFieldId InvalidScheduleFieldId { get; }
Visual Basic
Public Shared ReadOnly Property InvalidScheduleFieldId As ScheduleFieldId
	Get
Visual C++
public:
static property ScheduleFieldId^ InvalidScheduleFieldId {
	ScheduleFieldId^ get ();
}
See Also
ScheduleFieldId Class
Autodesk.Revit.DB Namespace